In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('citi-bikes.csv')
df

,first name,last name,tripduration,start station id,start station name,end station id,end station name,bikeid,usertype,birth year,gender,emails,pin
0,misty,HarRISs,3117,301,E 2 St & Avenue B,301,E 2 St & Avenue B,18070,Subscriber,1986.0,1,osborneangela@example.com,JPCeiknPMw
1,Alexis,Thompson,690,301,E 2 St & Avenue B,349,Rivington St & Ridge St,19699,Subscriber,1985.0,1,sbutler@example.net,PSxNqDPDWe
2,Jodi,Sanders,727,301,E 2 St & Avenue B,2010,Grand St & Greene St,20953,Subscriber,1982.0,1,egarcia@example.net,pxTMwm166p
3,matrick,Evans,698,301,E 2 St & Avenue B,527,E 33 St & 2 Ave,23566,Subscriber,1976.0,1,zmoore@example.com,w5dktoeXrq
4,Amanda,DaniEEls,351,301,E 2 St & Avenue B,250,Lafayette St & Jersey St,17545,Subscriber,1959.0,1,derrick11@example.com,8hHtmBR0Tt
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4207,Joshua,Donaldson,1225,301,E 2 St & Avenue B,442,W 27 St & 7 Ave,15859,Customer,NaN,0,kelly26@example.net,NaaPhq7R38
4208,Deanna,Nelson,939,301,E 2 St & Avenue B,251,Mott St & Prince St,15683,Customer,NaN,0,seth26@example.net,PWs7OnO37x
4209,Jennifer,Sanchez,914,301,E 2 St & Avenue B,251,Mott St & Prince St,20219,Customer,NaN,0,tamara26@example.org,NNEAV3nI8i
4210,Steven,Riley,1581,301,E 2 St & Avenue B,465,Broadway & W 41 St,23176,Subscriber,1996.0,2,carlosstevenson@example.com,dGBYIsZzM2
4211,Taylor,Hancock,247,301,E 2 St & Avenue B,511,E 14 St & Avenue B,23484,Subscriber,1982.0,1,arnolddaniel@example.com,v2VFozNw7y

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4212 entries, 0 to 4211
Data columns (total 13 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   first name          4212 non-null   object
 1   last name           4212 non-null   object
 2   tripduration        4212 non-null   int64
 3   start station id    4212 non-null   int64
 4   start station name  4212 non-null   object
 5   end station id      4212 non-null   int64
 6   end station name    4212 non-null   object
 7   bikeid              4212 non-null   int64
 8   usertype            4212 non-null   object
 9   birth year          3682 non-null   float64
 10  gender              4212 non-null   int64
 11  emails              4212 non-null   object
 12  pin                 4212 non-null   object
dtypes: float64(1), int64(5), object(7)
memory usage: 427.9+ KB

# Let start the Practice
_Don't forget to run all cells before_

**1. Capitalize the column `first name`**  
*Save your resulting values in capital_first_name variable*

In [13]:
capital_first_name = df.iloc[:, 0].str.capitalize()

**2. Make the Column `last name` as lower case**   
*Store the result in the variable `lower_last_name`*

In [15]:
lower_last_name =  df.iloc[:, 1].str.lower()
lower_last_name

0         harriss
1        thompson
2         sanders
3           evans
4        danieels
          ...
4207    donaldson
4208       nelson
4209      sanchez
4210        riley
4211      hancock
Name: last name, Length: 4212, dtype: object

**3. Make the Column `last name` as Upper case.**  
*Store your answer in the variable `upper_last_name`*

In [17]:
upper_last_name  = df.iloc[:, 1].str.upper()

### Lets check how many different `usertype` are there:

In [19]:
usertypes_num = df['usertype'].unique()
usertypes_num

array(['Subscriber', 'Customer'], dtype=object)

In [20]:
unique_usertype = df['usertype'].nunique()
unique_usertype

2

**4. How many users in the Column `usertype` are `Customer`**  
*Store your result in the variable customer_counts*

In [30]:
customer_counts = df["usertype"].str.count("Customer").sum()
customer_counts

530

**5. How many users in the Column `usertype` are `Subscribers`**

In [33]:
subscriber_counts = df["usertype"].str.count("Subscriber").sum()
subscriber_counts

3682

**6. Find the words in Column `pin` which contain the substring `lol`.**  
*And store your selection in the variable `word_having_lols`**

In [34]:
word_having_lols = df["pin"].str.contains("lol")
df['pin'][word_having_lols]

59        Vtdqzzlolk
65          foundlol
117       loVulolKDF
167       nlolzlVd23
2656      6Kolol9toS
2660      lolLQigMjv
2679        FounDlol
2729      26lolbYZ66
2744      PlolJhPbGQ
2765     UuwlolrTHDW
2783      kzlolZJvRk
2804      kfJAlolWxZ
2828      Eh8lolEwKd
2951    145loleGTrpG
Name: pin, dtype: object

**7. Find the names in the Column `first name` which start with `Z`.**   
*Store your result in the variable `starts_with_z`*

In [36]:
starts_with_z = df["first name"].str.startswith("Z")
df['first name'][starts_with_z]

233     Zachary
348     Zachary
431     Zachary
651     Zachary
847     Zachary
1035    Zachary
1270    Zachary
1366    Zachary
1451    Zachary
2371    Zachary
2508    Zachary
2589    Zachary
2854    Zachary
2964    Zachary
3128    Zachary
3156    Zachary
3535    Zachary
3581    Zachary
3712    Zachary
3814    Zachary
Name: first name, dtype: object

20

**8. How many values in the Column `first name` start with the word `Z`**

In [43]:
starts_with_z = df['first name'][starts_with_z].count()

**9. Find the names in the Column `last name` which end with 't' and store your result in the variable `ends_with_t`**

In [45]:
ends_with_t = df["last name"].str.endswith("t")
df['last name'][ends_with_t]

67      Lambert
101     Elliott
111      Knight
117     Burnett
126       Grant
         ...
4107     Hebert
4140     Bryant
4159    Stewart
4181    Garrett
4183     Wright
Name: last name, Length: 145, dtype: object

**10. How many values in the Column `last name` end with 't'**

In [47]:
df['last name'][ends_with_t].count()

145

**11. Concatenate 'bikeid' Entries with Space Separator**

In [48]:
# don't remove the code line below
df['bikeid']=df['bikeid'].astype(str)
############## WRITE YOUR CODE BELOW ##########################

spaced_bikeids = df['bikeid'].str.join(" ")

In [50]:
spaced_bikeids

0       1 8 0 7 0
1       1 9 6 9 9
2       2 0 9 5 3
3       2 3 5 6 6
4       1 7 5 4 5
          ...
4207    1 5 8 5 9
4208    1 5 6 8 3
4209    2 0 2 1 9
4210    2 3 1 7 6
4211    2 3 4 8 4
Name: bikeid, Length: 4212, dtype: object

**12. Create a new Column named `name length` having all the lengths of names from the Column `first name`**

In [51]:
df['name length'] = df["first name"].str.len()

**13. Find if the Column `pin` has alpha numeric values or it contains only digits**

In [71]:
df[df["pin"].str.isalpha() == True]

,first name,last name,tripduration,start station id,start station name,end station id,end station name,bikeid,usertype,birth year,gender,emails,pin,name length
0,misty,HarRISs,3117,301,E 2 St & Avenue B,301,E 2 St & Avenue B,18070,Subscriber,1986.0,1,osborneangela@example.com,JPCeiknPMw,5
1,Alexis,Thompson,690,301,E 2 St & Avenue B,349,Rivington St & Ridge St,19699,Subscriber,1985.0,1,sbutler@example.net,PSxNqDPDWe,6
5,Douglas,Schroeder,597,301,E 2 St & Avenue B,497,E 17 St & Broadway,17435,Subscriber,1979.0,1,stefanieedwards@example.com,JTRVEvdpkR,7
18,Kristine,Ashley,1168,301,E 2 St & Avenue B,491,E 24 St & Park Ave S,16899,Customer,NaN,0,charlesjohnson@example.org,uscwJFeZnf,8
25,Tracy,Peters,952,301,E 2 St & Avenue B,491,E 24 St & Park Ave S,18803,Subscriber,1967.0,2,goodwinkaren@example.org,wOKzDBDXaw,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4192,Luis,Conrad,1002,301,E 2 St & Avenue B,329,Greenwich St & N Moore St,22898,Subscriber,1989.0,1,rtucker@example.net,bCpwBJggPH,4
4202,David,Mitchell,367,301,E 2 St & Avenue B,300,Shevchenko Pl & E 7 St,23409,Subscriber,1958.0,1,stevenbradley@example.net,kpPImRqCOz,5
4203,Sonya,Simmons,474,301,E 2 St & Avenue B,229,Great Jones St,16263,Subscriber,1942.0,1,hancockshawn@example.net,XmnfJxqGBd,5
4204,Michael,Dorsey,523,301,E 2 St & Avenue B,325,E 19 St & 3 Ave,22723,Subscriber,1991.0,1,adamsangelica@example.org,lBYlDojFXY,7
4206,Kelly,Palmer,401,301,E 2 St & Avenue B,300,Shevchenko Pl & E 7 St,23134,Subscriber,1995.0,1,katrina06@example.org,viVypstgPV,5

**14. Verify if the Column `tripduration` has any non-numeric values or it contains digits only**

In [76]:
# don't remove the code line below
df['tripduration'] = df['tripduration'].astype(str)
############## WRITE YOUR CODE BELOW ##########################
df.loc[df["tripduration"].str.isdigit() == False]

Empty DataFrame
Columns: [first name, last name, tripduration, start station id, start station name, end station id, end station name, bikeid, usertype, birth year, gender, emails, pin, name length]
Index: []

**15. Check if any name in the Column `first name` has digit(s) or number(s) in it.**

In [80]:
df.loc[df["first name"].str.isdigit() == True]

Empty DataFrame
Columns: [first name, last name, tripduration, start station id, start station name, end station id, end station name, bikeid, usertype, birth year, gender, emails, pin, name length]
Index: []

**16.Split the emails in the `emails` column at `@` to find the Domain names and store them in the variable `email_domains`**

In [84]:
email_domains= df["emails"].str.split("@").str[1]
email_domains

0       example.com
1       example.net
2       example.net
3       example.com
4       example.com
           ...
4207    example.net
4208    example.net
4209    example.org
4210    example.com
4211    example.com
Name: emails, Length: 4212, dtype: object

**17. Replace the emails having `.edu` with `.org` and store the output in the variable `edu_to_org`**

In [86]:
edu_to_org = df["emails"].str.replace(".edu", ".org")

**18. Replace the numeric and the St values in  `end station name` Column with  space ` ` so that we can filter the address without street numbers. Store your result in the variable `clean_address`**

*Use `r'\d+|St'`*

In [80]:
clean_address = df["end station name"].str.replace(r'\d+|St', )